Revit 2026 API

# FormattedText(String) Constructor

---

Creates a new FormattedText object with unformatted text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FormattedText(
	string plainText
)
```
```vb
Public Sub New (
	plainText As String
)
```
```cpp
public:
FormattedText(
	String^ plainText
)
```
```fsharp
new :
        plainText : string -> FormattedText
```

#### Parameters

plainText String
     The text in a plain text form.

| Exception | Condition |
| --- | --- |
| ArgumentException | plainText (excluding a carriage return character ('\r') at the end) has more than 30,000 characters. -or- plainText contains invalid characters such as a newline character. |
| ArgumentNullException | A non-optional argument was null |

The given text should have no more than 30,000 characters. Line feed characters ('/n') are not allowed. An empty string is allowed.

#### Reference

FormattedText Class

FormattedText Overload

Autodesk.Revit.DB Namespace